АлогистикТест2/src/InformationRegisters/алк_ФорматКПроизводству/алк_ФорматКПроизводству.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ФорматКПроизводству</name>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линия</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ФорматКПроизводству/ManagerModule.bsl
Функция ПолучитьХарактеристикиЗаСменуПоЛинии(ДатаСмены,Смена,Линия) Экспорт    
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ФорматКПроизводству.Характеристика
	               |ИЗ
	               |	РегистрСведений.алк_ФорматКПроизводству КАК алк_ФорматКПроизводству
	               |ГДЕ
	               |	алк_ФорматКПроизводству.ДатаСмены = &ДатаСмены
	               |	И алк_ФорматКПроизводству.Смена = &Смена
	               |	И алк_ФорматКПроизводству.Линия = &Линия";
	
	Запрос.УстановитьПараметр("ДатаСмены",ДатаСмены);
	Запрос.УстановитьПараметр("Смена",Смена);
	Запрос.УстановитьПараметр("Линия",Линия);  
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;  
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат.Выгрузить());
	
КонецФункции 

//данные по смене - структура дата смены + смена + линия(участок)
Процедура ДобавитьЗаданиеПоХарактеристикамВРегистр(ДанныеПоСмене, МассивХарактеристик) Экспорт     
	
	НаборЗаписей = РегистрыСведений.алк_ФорматКПроизводству.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ДатаСмены.Установить(ДанныеПоСмене.ДатаСмены);
	
	НаборЗаписей.Отбор.Смена.Установить(ДанныеПоСмене.Смена);
	
	НаборЗаписей.Отбор.Линия.Установить(ДанныеПоСмене.Линия);  
	
	НаборЗаписей.Прочитать();  
	
	НаборЗаписей.Очистить();	
		
	Для Каждого стр ИЗ МассивХарактеристик Цикл  
		
		Запись = НаборЗаписей.Добавить();  
		
		ЗаполнитьЗначенияСвойств(Запись, ДанныеПоСмене);
		
		Запись.Характеристика = стр.Характеристика;
		
		Запись.Номер = стр.НомерСтроки;
				
	КонецЦикла;
	
	НаборЗаписей.Записать(ИСТИНА);	
	
КонецПроцедуры  

//возвращает булево
Функция ХарактеристикаПоЗаданию(ДатаСмены,Смена,Линия,Характеристика) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ФорматКПроизводству.Характеристика
	               |ИЗ
	               |	РегистрСведений.алк_ФорматКПроизводству КАК алк_ФорматКПроизводству
	               |ГДЕ
	               |	алк_ФорматКПроизводству.ДатаСмены = &ДатаСмены
	               |	И алк_ФорматКПроизводству.Смена = &Смена
	               |	И алк_ФорматКПроизводству.Линия = &Линия
	               |	И алк_ФорматКПроизводству.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("ДатаСмены",ДатаСмены);
	Запрос.УстановитьПараметр("Смена",Смена);
	Запрос.УстановитьПараметр("Линия",Линия);
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Ложь;
	КонецЕсли;  
	
	Возврат Истина;

КонецФункции
